byrmeng/arduino-esp32-core/boards.txt
deneyapmini.menu.FlashFreq.80=80MHz
deneyapmini.menu.FlashFreq.80.build.flash_freq=80m
deneyapmini.menu.FlashFreq.40=40MHz
deneyapmini.menu.FlashFreq.40.build.flash_freq=40m

deneyapmini.menu.FlashSize.4M=4MB (32Mb)
deneyapmini.menu.FlashSize.4M.build.flash_size=4MB
deneyapmini.menu.FlashSize.8M=8MB (64Mb)
deneyapmini.menu.FlashSize.8M.build.flash_size=8MB
deneyapmini.menu.FlashSize.2M=2MB (16Mb)
deneyapmini.menu.FlashSize.2M.build.flash_size=2MB
deneyapmini.menu.FlashSize.16M=16MB (128Mb)
deneyapmini.menu.FlashSize.16M.build.flash_size=16MB

deneyapmini.menu.UploadSpeed.921600=921600
deneyapmini.menu.UploadSpeed.921600.upload.speed=921600
deneyapmini.menu.UploadSpeed.115200=115200
deneyapmini.menu.UploadSpeed.115200.upload.speed=115200
deneyapmini.menu.UploadSpeed.256000.windows=256000
deneyapmini.menu.UploadSpeed.256000.upload.speed=256000
deneyapmini.menu.UploadSpeed.230400.windows.upload.speed=256000
deneyapmini.menu.UploadSpeed.230400=230400
deneyapmini.menu.UploadSpeed.230400.upload.speed=230400
deneyapmini.menu.UploadSpeed.460800.linux=460800
deneyapmini.menu.UploadSpeed.460800.macosx=460800
deneyapmini.menu.UploadSpeed.460800.upload.speed=460800
deneyapmini.menu.UploadSpeed.512000.windows=512000
deneyapmini.menu.UploadSpeed.512000.upload.speed=512000

deneyapmini.menu.DebugLevel.none=None
deneyapmini.menu.DebugLevel.none.build.code_debug=0
deneyapmini.menu.DebugLevel.error=Error
deneyapmini.menu.DebugLevel.error.build.code_debug=1
deneyapmini.menu.DebugLevel.warn=Warn
deneyapmini.menu.DebugLevel.warn.build.code_debug=2
deneyapmini.menu.DebugLevel.info=Info
deneyapmini.menu.DebugLevel.info.build.code_debug=3
deneyapmini.menu.DebugLevel.debug=Debug
deneyapmini.menu.DebugLevel.debug.build.code_debug=4
deneyapmini.menu.DebugLevel.verbose=Verbose
deneyapmini.menu.DebugLevel.verbose.build.code_debug=5

deneyapmini.menu.EraseFlash.none=Disabled
deneyapmini.menu.EraseFlash.none.upload.erase_cmd=
deneyapmini.menu.EraseFlash.all=Enabled
deneyapmini.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

deneyapminiv2.name=Deneyap Mini v2

deneyapminiv2.vid.0=0x303a
deneyapminiv2.pid.0=0x8144

deneyapminiv2.bootloader.tool=esptool_py
deneyapminiv2.bootloader.tool.default=esptool_py

deneyapminiv2.upload.tool=esptool_py
deneyapminiv2.upload.tool.default=esptool_py
deneyapminiv2.upload.tool.network=esp_ota

deneyapminiv2.upload.maximum_size=1310720
deneyapminiv2.upload.maximum_data_size=327680
deneyapminiv2.upload.flags=
deneyapminiv2.upload.extra_flags=
deneyapminiv2.upload.use_1200bps_touch=false
deneyapminiv2.upload.wait_for_upload_port=false

deneyapminiv2.serial.disableDTR=false
deneyapminiv2.serial.disableRTS=false

deneyapminiv2.build.tarch=xtensa
deneyapminiv2.build.bootloader_addr=0x1000
deneyapminiv2.build.target=esp32s2
deneyapminiv2.build.mcu=esp32s2
deneyapminiv2.build.core=esp32
deneyapminiv2.build.variant=deneyapminiv2
deneyapminiv2.build.board=DYMv2

deneyapminiv2.build.cdc_on_boot=1
deneyapminiv2.build.msc_on_boot=0
deneyapminiv2.build.dfu_on_boot=0
deneyapminiv2.build.f_cpu=240000000L
deneyapminiv2.build.flash_size=4MB
deneyapminiv2.build.flash_freq=80m
deneyapminiv2.build.flash_mode=dio
deneyapminiv2.build.boot=qio
deneyapminiv2.build.partitions=default
deneyapminiv2.build.defines=-DBOARD_HAS_PSRAM

## IDE 2.0 Seems to not update the value
deneyapminiv2.menu.JTAGAdapter.default=Disabled
deneyapminiv2.menu.JTAGAdapter.default.build.copy_jtag_files=0
deneyapminiv2.menu.JTAGAdapter.external=FTDI Adapter
deneyapminiv2.menu.JTAGAdapter.external.build.openocdscript=esp32s2-kaluga-1.cfg
deneyapminiv2.menu.JTAGAdapter.external.build.copy_jtag_files=1
deneyapminiv2.menu.JTAGAdapter.bridge=ESP USB Bridge
deneyapminiv2.menu.JTAGAdapter.bridge.build.openocdscript=esp32s2-bridge.cfg
deneyapminiv2.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

deneyapminiv2.menu.CDCOnBoot.cdc=Enabled
deneyapminiv2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
deneyapminiv2.menu.CDCOnBoot.default=Disabled
deneyapminiv2.menu.CDCOnBoot.default.build.cdc_on_boot=0

deneyapminiv2.menu.MSCOnBoot.default=Disabled
deneyapminiv2.menu.MSCOnBoot.default.build.msc_on_boot=0
deneyapminiv2.menu.MSCOnBoot.msc=Enabled
deneyapminiv2.menu.MSCOnBoot.msc.build.msc_on_boot=1

deneyapminiv2.menu.DFUOnBoot.default=Disabled
deneyapminiv2.menu.DFUOnBoot.default.build.dfu_on_boot=0
deneyapminiv2.menu.DFUOnBoot.dfu=Enabled
deneyapminiv2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

deneyapminiv2.menu.UploadMode.cdc=Internal USB
deneyapminiv2.menu.UploadMode.cdc.upload.use_1200bps_touch=true
deneyapminiv2.menu.UploadMode.cdc.upload.wait_for_upload_port=true
deneyapminiv2.menu.UploadMode.default=UART0
deneyapminiv2.menu.UploadMode.default.upload.use_1200bps_touch=false
deneyapminiv2.menu.UploadMode.default.upload.wait_for_upload_port=false

deneyapminiv2.menu.PSRAM.enabled=Enabled
deneyapminiv2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
deneyapminiv2.menu.PSRAM.disabled=Disabled
deneyapminiv2.menu.PSRAM.disabled.build.defines=

deneyapminiv2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
deneyapminiv2.menu.PartitionScheme.default.build.partitions=default
deneyapminiv2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
deneyapminiv2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
deneyapminiv2.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
deneyapminiv2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
deneyapminiv2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
deneyapminiv2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
deneyapminiv2.menu.PartitionScheme.minimal.build.partitions=minimal
deneyapminiv2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
deneyapminiv2.menu.PartitionScheme.no_ota.build.partitions=no_ota
deneyapminiv2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
deneyapminiv2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
deneyapminiv2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
deneyapminiv2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
deneyapminiv2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
deneyapminiv2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
deneyapminiv2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
deneyapminiv2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
deneyapminiv2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
deneyapminiv2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
deneyapminiv2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
deneyapminiv2.menu.PartitionScheme.huge_app.build.partitions=huge_app
deneyapminiv2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
deneyapminiv2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
deneyapminiv2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
deneyapminiv2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
deneyapminiv2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
deneyapminiv2.menu.PartitionScheme.fatflash.build.partitions=ffat
deneyapminiv2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
deneyapminiv2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
deneyapminiv2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
deneyapminiv2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
deneyapminiv2.menu.PartitionScheme.rainmaker=RainMaker 4MB
deneyapminiv2.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
deneyapminiv2.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
deneyapminiv2.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
deneyapminiv2.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
deneyapminiv2.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
deneyapminiv2.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
deneyapminiv2.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
deneyapminiv2.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4116480

deneyapminiv2.menu.CPUFreq.240=240MHz (WiFi)
deneyapminiv2.menu.CPUFreq.240.build.f_cpu=240000000L
deneyapminiv2.menu.CPUFreq.160=160MHz (WiFi)
deneyapminiv2.menu.CPUFreq.160.build.f_cpu=160000000L
deneyapminiv2.menu.CPUFreq.80=80MHz (WiFi)
deneyapminiv2.menu.CPUFreq.80.build.f_cpu=80000000L
deneyapminiv2.menu.CPUFreq.40=40MHz
deneyapminiv2.menu.CPUFreq.40.build.f_cpu=40000000L
deneyapminiv2.menu.CPUFreq.20=20MHz
deneyapminiv2.menu.CPUFreq.20.build.f_cpu=20000000L
deneyapminiv2.menu.CPUFreq.10=10MHz
deneyapminiv2.menu.CPUFreq.10.build.f_cpu=10000000L

deneyapminiv2.menu.FlashMode.qio=QIO
deneyapminiv2.menu.FlashMode.qio.build.flash_mode=dio
deneyapminiv2.menu.FlashMode.qio.build.boot=qio
deneyapminiv2.menu.FlashMode.dio=DIO
deneyapminiv2.menu.FlashMode.dio.build.flash_mode=dio
deneyapminiv2.menu.FlashMode.dio.build.boot=dio

